{
    "format": "layers-model",
    "generatedBy": "keras v2.2.4-tf",
    "convertedBy": "TensorFlow.js Converter v1.0.1",
    "modelTopology": {
        "keras_version": "2.2.4-tf",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_14",
                "layers": [
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_44",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                12,
                                9
                            ],
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                5
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 2.0,
                                    "mode": "fan_in",
                                    "distribution": "uniform",
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_38",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                2
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_14",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_45",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 256,
                            "kernel_size": [
                                3
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 2.0,
                                    "mode": "fan_in",
                                    "distribution": "uniform",
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_39",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                2
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_15",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_46",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                1
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 2.0,
                                    "mode": "fan_in",
                                    "distribution": "uniform",
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_40",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                2
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_16",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_4",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_17",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 32,
                            "activation": "tanh",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_3",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.25,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_18",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization_38/gamma",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_38/beta",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_38/moving_mean",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_38/moving_variance",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_39/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_39/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_39/moving_mean",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_39/moving_variance",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_40/gamma",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_40/beta",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_40/moving_mean",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_40/moving_variance",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_44/kernel",
                    "shape": [
                        5,
                        9,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_44/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_45/kernel",
                    "shape": [
                        3,
                        128,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_45/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_46/kernel",
                    "shape": [
                        1,
                        256,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_46/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_17/kernel",
                    "shape": [
                        768,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_17/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_18/kernel",
                    "shape": [
                        32,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_18/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}