{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Conv1D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D1","trainable":true,"batch_input_shape":[null,6,6],"dtype":"float32"}},{"class_name":"Conv1D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D2","trainable":true}},{"class_name":"MaxPooling1D","config":{"pool_size":[2],"padding":"valid","strides":[2],"name":"max_pooling1d_MaxPooling1D1","trainable":true}},{"class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D3","trainable":true}},{"class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D4","trainable":true}},{"class_name":"GlobalAveragePooling1D","config":{"name":"global_average_pooling1d_GlobalAveragePooling1D1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.35,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}}],"keras_version":"tfjs-layers 0.8.3","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./annModel.weights.bin"],"weights":[{"name":"conv1d_Conv1D1/kernel","shape":[3,6,16],"dtype":"float32"},{"name":"conv1d_Conv1D1/bias","shape":[16],"dtype":"float32"},{"name":"conv1d_Conv1D2/kernel","shape":[3,16,32],"dtype":"float32"},{"name":"conv1d_Conv1D2/bias","shape":[32],"dtype":"float32"},{"name":"conv1d_Conv1D3/kernel","shape":[1,32,64],"dtype":"float32"},{"name":"conv1d_Conv1D3/bias","shape":[64],"dtype":"float32"},{"name":"conv1d_Conv1D4/kernel","shape":[1,64,64],"dtype":"float32"},{"name":"conv1d_Conv1D4/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[64,3],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[3],"dtype":"float32"}]}]}