{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"GRU","config":{"units":64,"activation":"elu","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"Zeros","config":{}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"gru_GRU3","trainable":true,"batch_input_shape":[null,6,4],"dtype":"float32"}},{"class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true}}],"keras_version":"tfjs-layers 0.8.3","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./gru-model.weights.bin"],"weights":[{"name":"gru_GRU3/kernel","shape":[4,192],"dtype":"float32"},{"name":"gru_GRU3/recurrent_kernel","shape":[64,192],"dtype":"float32"},{"name":"gru_GRU3/bias","shape":[192],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[384,32],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense10/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[8,3],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[3],"dtype":"float32"}]}]}