{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"LSTM","config":{"units":64,"activation":"elu","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM4","trainable":true,"batch_input_shape":[null,6,3],"dtype":"float32"}},{"class_name":"Flatten","config":{"name":"flatten_Flatten4","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense16","trainable":true}}],"keras_version":"tfjs-layers 0.8.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./lstm-model.weights.bin"],"weights":[{"name":"lstm_LSTM4/kernel","shape":[3,256],"dtype":"float32"},{"name":"lstm_LSTM4/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM4/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[384,32],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense16/kernel","shape":[8,3],"dtype":"float32"},{"name":"dense_Dense16/bias","shape":[3],"dtype":"float32"}]}]}